# Запросить у пользователя ввод имени и возраста
name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")

# Вывести сообщение с именем и возрастом пользователя
print("Привет, " + name + "! Тебе " + age )

name = input("Как Вас зовут?")
age = int(input("Сколько Вам лет?"))
print(age, name)